# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

# Пример:

# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

x = "0"
y = "0"

def isfloat(s):
    try:
        float(s)
        return True
    except ValueError:
        return False

def inp(a):
    while not (isfloat(a) and (float(a) != 0 )):
        a = input('Введите координату - ')
    return a

x = float(inp(x))
y = float(inp(y))
if (x > 0 and y > 0):
    print("координата (",x,",",y,") - первой четверти")
elif (x < 0 and y > 0):
    print("координата (",x,",",y,") - второй четверти")
elif (x < 0 and y < 0):
    print("координата (",x,",",y,") - третьей четверти")
else :
    print("координата (",x,",",y,") - четвертой четверти")