

"""CONST MENU"""

MAIN_MENU = "1 - посмотреть все заметки\n2 - найти заметку по номеру\n3 - найти заметку по дате\n4 - редактировать заметку\n5 - удалить заметку\n6 - добавить заметку\nq - выход\n"
QUIT_MESSAGE = "До свидания!"
ID_INVITE_FIND = "Введите номер заметки для поиска - "
ID_INVITE_DELETE = "Введите номер заметки для удаления - "
ID_INVITE_EDIT = "Введите номер заметки для редактирования - "
DATE_START = "Введите дату начала поиска (dd/mm/yyyy hh:mm) - "
DATE_STOP = "Введите дату конца поиска (dd/mm/yyyy hh:mm) - "


""""CONST DB"""

MAX_ID = 1000
GET_TITLE = "Введите название заметки - "
GET_MSG = "Введите сообщение для заметки - "
HEADER = ['ID', 'DateTime', 'Tittle', 'MSG']
PATH = "db.csv"
ERROR = ["введите номер корректно"]
NO_COINCIDE = ['совпадений не найдено']
